## 01. 객체 간 연산

## 참고자료
* [Python 완전정복 시리즈] 2편 : Pandas DataFrame 완전정복 : https://wikidocs.net/book/7188

In [12]:
import pandas as pd
import numpy as np

In [5]:
data = {'A' : [1,2], 'B': [3,4]}
df = pd.DataFrame(data=data)
print(df)

   A  B
0  1  3
1  2  4

In [27]:
# data = np.array([1,2,], [3,4]) ERROR : np.array()안에는 하나의 리스트만 들어갈 수 있음
data = np.array([[1,2], [3,4]])
df = pd.DataFrame(data=data, index=['row1','row2'], columns=['col1', 'col2'])
print(df)

      col1  col2
row1     1     2
row2     3     4

In [29]:
data = [[1,10,100],[2,20,200],[3,30,300]]
col = ['col1','col2','col3']
row = ['row1','row2','row3']
df = pd.DataFrame(data=data,index=row,columns=col)
print(df)

      col1  col2  col3
row1     1    10   100
row2     2    20   200
row3     3    30   300

## 덧셈

In [32]:
# 스칼라 값 더하기

#df.add(스칼라 값)의 경우 df+스칼라값과 같은 결과를 가집니다.

result = df.add(1)
print(result)

      col1  col2  col3
row1     2    11   101
row2     3    21   201
row3     4    31   301
      col1  col2  col3
row1     2    11   101
row2     3    21   201
row3     4    31   301

In [31]:
result = df + 1
print(result)

      col1  col2  col3
row1     2    11   101
row2     3    21   201
row3     4    31   301

In [34]:
# 다른 DataFrame 객체를 더하기

data2 = [[3], [4], [5]]
df2 = pd.DataFrame(data=data2, index=['row1', 'row2', 'row3'], columns=['col1'])
print(df2)

      col1
row1     3
row2     4
row3     5

In [35]:
result = df.add(df2)
print(result)

      col1  col2  col3
row1     4   NaN   NaN
row2     6   NaN   NaN
row3     8   NaN   NaN

In [37]:
result = df.add(df2, fill_value=0)
print(result)

      col1  col2   col3
row1     4  10.0  100.0
row2     6  20.0  200.0
row3     8  30.0  300.0

## 뺄셈

In [38]:
# 뺄셈

data = [[1,10,100],[2,20,200],[3,30,300]]
col = ['col1','col2','col3']
row = ['row1','row2','row3']
df = pd.DataFrame(data=data,index=row,columns=col)
print(df)

      col1  col2  col3
row1     1    10   100
row2     2    20   200
row3     3    30   300

In [39]:
# 스칼라 값 빼기
result = df.sub(1)
print(result)

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [41]:
result = df.sub(1)
print(result)

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [42]:
result = df-1
print(result)

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [43]:
# 다른 DataFrame객체를 빼기
data2 = [[3],[4],[5]]
df2 = pd.DataFrame(data=data2,index=['row1','row2','row3'],columns=['col1'])
print(df2)

      col1
row1     3
row2     4
row3     5

In [44]:
result = df.sub(df2)
print(result)

      col1  col2  col3
row1    -2   NaN   NaN
row2    -2   NaN   NaN
row3    -2   NaN   NaN

In [45]:
result = df.sub(df2, fill_value=0)
print(result)

      col1  col2   col3
row1    -2  10.0  100.0
row2    -2  20.0  200.0
row3    -2  30.0  300.0

## 곱셈

In [46]:
df = pd.DataFrame(data=data,index=row,columns=col)
print(df)

      col1  col2  col3
row1     1    10   100
row2     2    20   200
row3     3    30   300

In [47]:
# 스칼라 값 곱하기
result = df.mul(2)
print(result)

      col1  col2  col3
row1     2    20   200
row2     4    40   400
row3     6    60   600

In [48]:
result = df*2
print(result)

      col1  col2  col3
row1     2    20   200
row2     4    40   400
row3     6    60   600

In [ ]:
# 다른 DataFrame객체를 곱하기

In [49]:
df2 = pd.DataFrame(data=data2,index=['row1','row2','row3'],columns=['col1'])
print(df2)

      col1
row1     3
row2     4
row3     5

In [52]:
result = df.mul(df2)
print(result)

      col1  col2  col3
row1     3   NaN   NaN
row2     8   NaN   NaN
row3    15   NaN   NaN

In [53]:
result = df.mul(df2, fill_value=0)
print(result)

      col1  col2  col3
row1     3   0.0   0.0
row2     8   0.0   0.0
row3    15   0.0   0.0

## 나눗셈

In [55]:
# 스칼라값 나누기
result = df.div(2)
print(result)

      col1  col2   col3
row1   0.5   5.0   50.0
row2   1.0  10.0  100.0
row3   1.5  15.0  150.0

In [56]:
# 다른 DataFrame 객체를 나누기
result = df.div(df2)
print(result)

          col1  col2  col3
row1  0.333333   NaN   NaN
row2  0.500000   NaN   NaN
row3  0.600000   NaN   NaN

In [58]:
result = df.div(df2, fill_value=1)
# 0으로 나누면 div/0 에러 대신 inf 반환
print(result)

          col1  col2   col3
row1  0.333333  10.0  100.0
row2  0.500000  20.0  200.0
row3  0.600000  30.0  300.0

## 나머지

In [62]:
data = [[1,2,3],[4,5,6],[7,8,9]]
col = ['col1','col2','col3']
row = ['row1','row2','row3']
df = pd.DataFrame(data=data,index=row,columns=col)
print(df)

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [63]:
# 스칼라 값 나누기
df.mod(7)

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     0     1     2

In [64]:
df%7

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     0     1     2

In [68]:
# 다른 DataFrame 객체를 나누기
data2  = [[2],[3],[5]]
df2 = pd.DataFrame(data=data2,index=['row1','row2','row3'],columns=['col1'])
print(df2)

      col1
row1     2
row2     3
row3     5

In [69]:
df.mod(df2)

      col1  col2  col3
row1     1   NaN   NaN
row2     1   NaN   NaN
row3     2   NaN   NaN

In [72]:
df.mod(df2, fill_value=1)

      col1  col2  col3
row1     1   0.0   0.0
row2     1   0.0   0.0
row3     2   0.0   0.0

## 거듭제곱

In [74]:
# 스칼라값 제곱하기

df.pow(3)

      col1  col2  col3
row1     1     8    27
row2    64   125   216
row3   343   512   729

In [ ]:
# 다른 DataFrame 객체를 제곱하기

In [78]:
data2  = [[0],[3],[5]]
df2 = pd.DataFrame(data=data2,index=['row1','row2','row3'],columns=['col1'])
print(df2)

      col1
row1     0
row2     3
row3     5

In [80]:
df.pow(df2)

       col1  col2  col3
row1      1   NaN   NaN
row2     64   NaN   NaN
row3  16807   NaN   NaN

In [81]:
df.pow(df2, fill_value=0)

       col1  col2  col3
row1      1   1.0   1.0
row2     64   1.0   1.0
row3  16807   1.0   1.0

## 행렬곱